Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/qmi.h
// THIS HEADER FILE IS AUTOMATICALLY GENERATED -- DO NOT EDIT

/**
 * Copyright (c) 2024 Raspberry Pi Ltd.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
// =============================================================================
// Register block : QMI
// Version        : 1
// Bus type       : apb
// Description    : QSPI Memory Interface.
//
//                  Provides a memory-mapped interface to up to two
//                  SPI/DSPI/QSPI flash or PSRAM devices. Also provides a serial
//                  interface for programming and configuration of the external
//                  device.
// =============================================================================
#ifndef _HARDWARE_REGS_QMI_H
#define _HARDWARE_REGS_QMI_H
// =============================================================================
// Register    : QMI_DIRECT_CSR
// Description : Control and status for direct serial mode
//
//               Direct serial mode allows the processor to send and receive raw
//               serial frames, for programming, configuration and control of
//               the external memory devices. Only SPI mode 0 (CPOL=0 CPHA=0) is
//               supported.
#define QMI_DIRECT_CSR_OFFSET _u(0x00000000)
#define QMI_DIRECT_CSR_BITS   _u(0xffdf7ccf)
#define QMI_DIRECT_CSR_RESET  _u(0x01800000)
// -----------------------------------------------------------------------------
// Field       : QMI_DIRECT_CSR_RXDELAY
// Description : Delay the read data sample timing, in units of one half of a
//               system clock cycle. (Not necessarily half of an SCK cycle.)
#define QMI_DIRECT_CSR_RXDELAY_RESET  _u(0x0)
#define QMI_DIRECT_CSR_RXDELAY_BITS   _u(0xc0000000)
#define QMI_DIRECT_CSR_RXDELAY_MSB    _u(31)
#define QMI_DIRECT_CSR_RXDELAY_LSB    _u(30)
#define QMI_DIRECT_CSR_RXDELAY_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_DIRECT_CSR_CLKDIV
// Description : Clock divisor for direct serial mode. Divisors of 1..255 are
//               encoded directly, and the maximum divisor of 256 is encoded by
//               a value of CLKDIV=0.
//
//               The clock divisor can be changed on-the-fly by software,
//               without halting or otherwise coordinating with the serial
//               interface. The serial interface will sample the latest clock
//               divisor each time it begins the transmission of a new byte.
#define QMI_DIRECT_CSR_CLKDIV_RESET  _u(0x06)
#define QMI_DIRECT_CSR_CLKDIV_BITS   _u(0x3fc00000)
#define QMI_DIRECT_CSR_CLKDIV_MSB    _u(29)
#define QMI_DIRECT_CSR_CLKDIV_LSB    _u(22)
#define QMI_DIRECT_CSR_CLKDIV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_DIRECT_CSR_RXLEVEL
// Description : Current level of DIRECT_RX FIFO
#define QMI_DIRECT_CSR_RXLEVEL_RESET  _u(0x0)
#define QMI_DIRECT_CSR_RXLEVEL_BITS   _u(0x001c0000)
#define QMI_DIRECT_CSR_RXLEVEL_MSB    _u(20)
#define QMI_DIRECT_CSR_RXLEVEL_LSB    _u(18)
#define QMI_DIRECT_CSR_RXLEVEL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : QMI_DIRECT_CSR_RXFULL
// Description : When 1, the DIRECT_RX FIFO is currently full. The serial
//               interface will be stalled until data is popped; the interface
//               will not begin a new serial frame when the DIRECT_TX FIFO is
//               empty or the DIRECT_RX FIFO is full.
#define QMI_DIRECT_CSR_RXFULL_RESET  _u(0x0)
#define QMI_DIRECT_CSR_RXFULL_BITS   _u(0x00020000)
#define QMI_DIRECT_CSR_RXFULL_MSB    _u(17)
#define QMI_DIRECT_CSR_RXFULL_LSB    _u(17)
#define QMI_DIRECT_CSR_RXFULL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : QMI_DIRECT_CSR_RXEMPTY
// Description : When 1, the DIRECT_RX FIFO is currently empty. If the processor
//               attempts to read more data, the FIFO state is not affected, but
//               the value returned to the processor is undefined.
#define QMI_DIRECT_CSR_RXEMPTY_RESET  _u(0x0)
#define QMI_DIRECT_CSR_RXEMPTY_BITS   _u(0x00010000)
#define QMI_DIRECT_CSR_RXEMPTY_MSB    _u(16)
#define QMI_DIRECT_CSR_RXEMPTY_LSB    _u(16)
#define QMI_DIRECT_CSR_RXEMPTY_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : QMI_DIRECT_CSR_TXLEVEL
// Description : Current level of DIRECT_TX FIFO
#define QMI_DIRECT_CSR_TXLEVEL_RESET  _u(0x0)
#define QMI_DIRECT_CSR_TXLEVEL_BITS   _u(0x00007000)
#define QMI_DIRECT_CSR_TXLEVEL_MSB    _u(14)
#define QMI_DIRECT_CSR_TXLEVEL_LSB    _u(12)
#define QMI_DIRECT_CSR_TXLEVEL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : QMI_DIRECT_CSR_TXEMPTY
// Description : When 1, the DIRECT_TX FIFO is currently empty. Unless the
//               processor pushes more data, transmission will stop and BUSY
//               will go low once the current 8-bit serial frame completes.
#define QMI_DIRECT_CSR_TXEMPTY_RESET  _u(0x0)
#define QMI_DIRECT_CSR_TXEMPTY_BITS   _u(0x00000800)
#define QMI_DIRECT_CSR_TXEMPTY_MSB    _u(11)
#define QMI_DIRECT_CSR_TXEMPTY_LSB    _u(11)
#define QMI_DIRECT_CSR_TXEMPTY_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : QMI_DIRECT_CSR_TXFULL
// Description : When 1, the DIRECT_TX FIFO is currently full. If the processor
//               tries to write more data, that data will be ignored.
#define QMI_DIRECT_CSR_TXFULL_RESET  _u(0x0)
#define QMI_DIRECT_CSR_TXFULL_BITS   _u(0x00000400)
#define QMI_DIRECT_CSR_TXFULL_MSB    _u(10)
#define QMI_DIRECT_CSR_TXFULL_LSB    _u(10)
#define QMI_DIRECT_CSR_TXFULL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : QMI_DIRECT_CSR_AUTO_CS1N
// Description : When 1, automatically assert the CS1n chip select line whenever
//               the BUSY flag is set.
#define QMI_DIRECT_CSR_AUTO_CS1N_RESET  _u(0x0)
#define QMI_DIRECT_CSR_AUTO_CS1N_BITS   _u(0x00000080)
#define QMI_DIRECT_CSR_AUTO_CS1N_MSB    _u(7)
#define QMI_DIRECT_CSR_AUTO_CS1N_LSB    _u(7)
#define QMI_DIRECT_CSR_AUTO_CS1N_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_DIRECT_CSR_AUTO_CS0N
// Description : When 1, automatically assert the CS0n chip select line whenever
//               the BUSY flag is set.
#define QMI_DIRECT_CSR_AUTO_CS0N_RESET  _u(0x0)
#define QMI_DIRECT_CSR_AUTO_CS0N_BITS   _u(0x00000040)
#define QMI_DIRECT_CSR_AUTO_CS0N_MSB    _u(6)
#define QMI_DIRECT_CSR_AUTO_CS0N_LSB    _u(6)
#define QMI_DIRECT_CSR_AUTO_CS0N_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_DIRECT_CSR_ASSERT_CS1N
// Description : When 1, assert (i.e. drive low) the CS1n chip select line.
//
//               Note that this applies even when DIRECT_CSR_EN is 0.
#define QMI_DIRECT_CSR_ASSERT_CS1N_RESET  _u(0x0)
#define QMI_DIRECT_CSR_ASSERT_CS1N_BITS   _u(0x00000008)
#define QMI_DIRECT_CSR_ASSERT_CS1N_MSB    _u(3)
#define QMI_DIRECT_CSR_ASSERT_CS1N_LSB    _u(3)
#define QMI_DIRECT_CSR_ASSERT_CS1N_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_DIRECT_CSR_ASSERT_CS0N
// Description : When 1, assert (i.e. drive low) the CS0n chip select line.
//
//               Note that this applies even when DIRECT_CSR_EN is 0.
#define QMI_DIRECT_CSR_ASSERT_CS0N_RESET  _u(0x0)
#define QMI_DIRECT_CSR_ASSERT_CS0N_BITS   _u(0x00000004)
#define QMI_DIRECT_CSR_ASSERT_CS0N_MSB    _u(2)
#define QMI_DIRECT_CSR_ASSERT_CS0N_LSB    _u(2)
#define QMI_DIRECT_CSR_ASSERT_CS0N_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_DIRECT_CSR_BUSY
// Description : Direct mode busy flag. If 1, data is currently being shifted
//               in/out (or would be if the interface were not stalled on the RX
//               FIFO), and the chip select must not yet be deasserted.
//
//               The busy flag will also be set to 1 if a memory-mapped transfer
//               is still in progress when direct mode is enabled. Direct mode
//               blocks new memory-mapped transfers, but can't halt a transfer
//               that is already in progress. If there is a chance that memory-
//               mapped transfers may be in progress, the busy flag should be
//               polled for 0 before asserting the chip select.
//
//               (In practice you will usually discover this timing condition
//               through other means, because any subsequent memory-mapped
//               transfers when direct mode is enabled will return bus errors,
//               which are difficult to ignore.)
#define QMI_DIRECT_CSR_BUSY_RESET  _u(0x0)
#define QMI_DIRECT_CSR_BUSY_BITS   _u(0x00000002)
#define QMI_DIRECT_CSR_BUSY_MSB    _u(1)
#define QMI_DIRECT_CSR_BUSY_LSB    _u(1)
#define QMI_DIRECT_CSR_BUSY_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : QMI_DIRECT_CSR_EN
// Description : Enable direct mode.
//
//               In direct mode, software controls the chip select lines, and
//               can perform direct SPI transfers by pushing data to the
//               DIRECT_TX FIFO, and popping the same amount of data from the
//               DIRECT_RX FIFO.
//
//               Memory-mapped accesses will generate bus errors when direct
//               serial mode is enabled.
#define QMI_DIRECT_CSR_EN_RESET  _u(0x0)
#define QMI_DIRECT_CSR_EN_BITS   _u(0x00000001)
#define QMI_DIRECT_CSR_EN_MSB    _u(0)
#define QMI_DIRECT_CSR_EN_LSB    _u(0)
#define QMI_DIRECT_CSR_EN_ACCESS "RW"
// =============================================================================
// Register    : QMI_DIRECT_TX
// Description : Transmit FIFO for direct mode
#define QMI_DIRECT_TX_OFFSET _u(0x00000004)
#define QMI_DIRECT_TX_BITS   _u(0x001fffff)
#define QMI_DIRECT_TX_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : QMI_DIRECT_TX_NOPUSH
// Description : Inhibit the RX FIFO push that would correspond to this TX FIFO
//               entry.
//
//               Useful to avoid garbage appearing in the RX FIFO when pushing
//               the command at the beginning of a SPI transfer.
#define QMI_DIRECT_TX_NOPUSH_RESET  _u(0x0)
#define QMI_DIRECT_TX_NOPUSH_BITS   _u(0x00100000)
#define QMI_DIRECT_TX_NOPUSH_MSB    _u(20)
#define QMI_DIRECT_TX_NOPUSH_LSB    _u(20)
#define QMI_DIRECT_TX_NOPUSH_ACCESS "WF"
// -----------------------------------------------------------------------------
// Field       : QMI_DIRECT_TX_OE
// Description : Output enable (active-high). For single width (SPI), this field
//               is ignored, and SD0 is always set to output, with SD1 always
//               set to input.
//
//               For dual and quad width (DSPI/QSPI), this sets whether the
//               relevant SDx pads are set to output whilst transferring this
//               FIFO record. In this case the command/address should have OE
//               set, and the data transfer should have OE set or clear
//               depending on the direction of the transfer.
#define QMI_DIRECT_TX_OE_RESET  _u(0x0)
#define QMI_DIRECT_TX_OE_BITS   _u(0x00080000)
#define QMI_DIRECT_TX_OE_MSB    _u(19)
#define QMI_DIRECT_TX_OE_LSB    _u(19)
#define QMI_DIRECT_TX_OE_ACCESS "WF"
// -----------------------------------------------------------------------------
// Field       : QMI_DIRECT_TX_DWIDTH
// Description : Data width. If 0, hardware will transmit the 8 LSBs of the
//               DIRECT_TX DATA field, and return an 8-bit value in the 8 LSBs
//               of DIRECT_RX. If 1, the full 16-bit width is used. 8-bit and
//               16-bit transfers can be mixed freely.
#define QMI_DIRECT_TX_DWIDTH_RESET  _u(0x0)
#define QMI_DIRECT_TX_DWIDTH_BITS   _u(0x00040000)
#define QMI_DIRECT_TX_DWIDTH_MSB    _u(18)
#define QMI_DIRECT_TX_DWIDTH_LSB    _u(18)
#define QMI_DIRECT_TX_DWIDTH_ACCESS "WF"
// -----------------------------------------------------------------------------
// Field       : QMI_DIRECT_TX_IWIDTH
// Description : Configure whether this FIFO record is transferred with
//               single/dual/quad interface width (0/1/2). Different widths can
//               be mixed freely.
//               0x0 -> Single width
//               0x1 -> Dual width
//               0x2 -> Quad width
#define QMI_DIRECT_TX_IWIDTH_RESET  _u(0x0)
#define QMI_DIRECT_TX_IWIDTH_BITS   _u(0x00030000)
#define QMI_DIRECT_TX_IWIDTH_MSB    _u(17)
#define QMI_DIRECT_TX_IWIDTH_LSB    _u(16)
#define QMI_DIRECT_TX_IWIDTH_ACCESS "WF"
#define QMI_DIRECT_TX_IWIDTH_VALUE_S _u(0x0)
#define QMI_DIRECT_TX_IWIDTH_VALUE_D _u(0x1)
#define QMI_DIRECT_TX_IWIDTH_VALUE_Q _u(0x2)
// -----------------------------------------------------------------------------
// Field       : QMI_DIRECT_TX_DATA
// Description : Data pushed here will be clocked out falling edges of SCK (or
//               before the very first rising edge of SCK, if this is the first
//               pulse). For each byte clocked out, the interface will
//               simultaneously sample one byte, on rising edges of SCK, and
//               push this to the DIRECT_RX FIFO.
//
//               For 16-bit data, the least-significant byte is transmitted
//               first.
#define QMI_DIRECT_TX_DATA_RESET  _u(0x0000)
#define QMI_DIRECT_TX_DATA_BITS   _u(0x0000ffff)
#define QMI_DIRECT_TX_DATA_MSB    _u(15)
#define QMI_DIRECT_TX_DATA_LSB    _u(0)
#define QMI_DIRECT_TX_DATA_ACCESS "WF"
// =============================================================================
// Register    : QMI_DIRECT_RX
// Description : Receive FIFO for direct mode
//               With each byte clocked out on the serial interface, one byte
//               will simultaneously be clocked in, and will appear in this
//               FIFO. The serial interface will stall when this FIFO is full,
//               to avoid dropping data.
//
//               When 16-bit data is pushed into the TX FIFO, the corresponding
//               RX FIFO push will also contain 16 bits of data. The least-
//               significant byte is the first one received.
#define QMI_DIRECT_RX_OFFSET _u(0x00000008)
#define QMI_DIRECT_RX_BITS   _u(0x0000ffff)
#define QMI_DIRECT_RX_RESET  _u(0x00000000)
#define QMI_DIRECT_RX_MSB    _u(15)
#define QMI_DIRECT_RX_LSB    _u(0)
#define QMI_DIRECT_RX_ACCESS "RF"
// =============================================================================
// Register    : QMI_M0_TIMING
// Description : Timing configuration register for memory address window 0.
#define QMI_M0_TIMING_OFFSET _u(0x0000000c)
#define QMI_M0_TIMING_BITS   _u(0xf3fff7ff)
#define QMI_M0_TIMING_RESET  _u(0x40000004)
// -----------------------------------------------------------------------------
// Field       : QMI_M0_TIMING_COOLDOWN
// Description : Chip select cooldown period. When a memory transfer finishes,
//               the chip select remains asserted for 64 x COOLDOWN system clock
//               cycles, plus half an SCK clock period (rounded up for odd SCK
//               divisors). After this cooldown expires, the chip select is
//               always deasserted to save power.
//
//               If the next memory access arrives within the cooldown period,
//               the QMI may be able to append more SCK cycles to the currently
//               ongoing SPI transfer, rather than starting a new transfer. This
//               reduces access latency and increases bus throughput.
//
//               Specifically, the next access must be in the same direction
//               (read/write), access the same memory window (chip select 0/1),
//               and follow sequentially the address of the last transfer. If
//               any of these are false, the new access will first deassert the
//               chip select, then begin a new transfer.
//
//               If COOLDOWN is 0, the address alignment configured by PAGEBREAK
//               has been reached, or the total chip select assertion limit
//               MAX_SELECT has been reached, the cooldown period is skipped,
//               and the chip select will always be deasserted one half SCK
//               period after the transfer finishes.
#define QMI_M0_TIMING_COOLDOWN_RESET  _u(0x1)
#define QMI_M0_TIMING_COOLDOWN_BITS   _u(0xc0000000)
#define QMI_M0_TIMING_COOLDOWN_MSB    _u(31)
#define QMI_M0_TIMING_COOLDOWN_LSB    _u(30)
#define QMI_M0_TIMING_COOLDOWN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_M0_TIMING_PAGEBREAK
// Description : When page break is enabled, chip select will automatically
//               deassert when crossing certain power-of-2-aligned address
//               boundaries. The next access will always begin a new read/write
//               SPI burst, even if the address of the next access follows in
//               sequence with the last access before the page boundary.
//
//               Some flash and PSRAM devices forbid crossing page boundaries
//               with a single read/write transfer, or restrict the operating
//               frequency for transfers that do cross page a boundary. This
//               option allows the QMI to safely support those devices.
//
//               This field has no effect when COOLDOWN is disabled.
//               0x0 -> No page boundary is enforced
//               0x1 -> Break bursts crossing a 256-byte page boundary
//               0x2 -> Break bursts crossing a 1024-byte quad-page boundary
//               0x3 -> Break bursts crossing a 4096-byte sector boundary
#define QMI_M0_TIMING_PAGEBREAK_RESET  _u(0x0)
#define QMI_M0_TIMING_PAGEBREAK_BITS   _u(0x30000000)
#define QMI_M0_TIMING_PAGEBREAK_MSB    _u(29)
#define QMI_M0_TIMING_PAGEBREAK_LSB    _u(28)
#define QMI_M0_TIMING_PAGEBREAK_ACCESS "RW"
#define QMI_M0_TIMING_PAGEBREAK_VALUE_NONE _u(0x0)
#define QMI_M0_TIMING_PAGEBREAK_VALUE_256 _u(0x1)
#define QMI_M0_TIMING_PAGEBREAK_VALUE_1024 _u(0x2)
#define QMI_M0_TIMING_PAGEBREAK_VALUE_4096 _u(0x3)
// -----------------------------------------------------------------------------
// Field       : QMI_M0_TIMING_SELECT_SETUP
// Description : Add up to one additional system clock cycle of setup between
//               chip select assertion and the first rising edge of SCK.
//
//               The default setup time is one half SCK period, which is usually
//               sufficient except for very high SCK frequencies with some flash
//               devices.
#define QMI_M0_TIMING_SELECT_SETUP_RESET  _u(0x0)
#define QMI_M0_TIMING_SELECT_SETUP_BITS   _u(0x02000000)
#define QMI_M0_TIMING_SELECT_SETUP_MSB    _u(25)
#define QMI_M0_TIMING_SELECT_SETUP_LSB    _u(25)
#define QMI_M0_TIMING_SELECT_SETUP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_M0_TIMING_SELECT_HOLD
// Description : Add up to three additional system clock cycles of active hold
//               between the last falling edge of SCK and the deassertion of
//               this window's chip select.
//
//               The default hold time is one system clock cycle. Note that
//               flash datasheets usually give chip select active hold time from
//               the last *rising* edge of SCK, and so even zero hold from the
//               last falling edge would be safe.
//
//               Note that this is a minimum hold time guaranteed by the QMI:
//               the actual chip select active hold may be slightly longer for
//               read transfers with low clock divisors and/or high sample
//               delays. Specifically, if the point two cycles after the last RX
//               data sample is later than the last SCK falling edge, then the
//               hold time is measured from *this* point.
//
//               Note also that, in case the final SCK pulse is masked to save
//               energy (true for non-DTR reads when COOLDOWN is disabled or
//               PAGE_BREAK is reached), all of QMI's timing logic behaves as
//               though the clock pulse were still present. The SELECT_HOLD time
//               is applied from the point where the last SCK falling edge would
//               be if the clock pulse were not masked.
#define QMI_M0_TIMING_SELECT_HOLD_RESET  _u(0x0)
#define QMI_M0_TIMING_SELECT_HOLD_BITS   _u(0x01800000)
#define QMI_M0_TIMING_SELECT_HOLD_MSB    _u(24)
#define QMI_M0_TIMING_SELECT_HOLD_LSB    _u(23)
#define QMI_M0_TIMING_SELECT_HOLD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_M0_TIMING_MAX_SELECT
// Description : Enforce a maximum assertion duration for this window's chip
//               select, in units of 64 system clock cycles. If 0, the QMI is
//               permitted to keep the chip select asserted indefinitely when
//               servicing sequential memory accesses (see COOLDOWN).
//
//               This feature is required to meet timing constraints of PSRAM
//               devices, which specify a maximum chip select assertion so they
//               can perform DRAM refresh cycles. See also MIN_DESELECT, which
//               can enforce a minimum deselect time.
//
//               If a memory access is in progress at the time MAX_SELECT is
//               reached, the QMI will wait for the access to complete before
//               deasserting the chip select. This additional time must be
//               accounted for to calculate a safe MAX_SELECT value. In the
//               worst case, this may be a fully-formed serial transfer,
//               including command prefix and address, with a data payload as
//               large as one cache line.
#define QMI_M0_TIMING_MAX_SELECT_RESET  _u(0x00)
#define QMI_M0_TIMING_MAX_SELECT_BITS   _u(0x007e0000)
#define QMI_M0_TIMING_MAX_SELECT_MSB    _u(22)
#define QMI_M0_TIMING_MAX_SELECT_LSB    _u(17)
#define QMI_M0_TIMING_MAX_SELECT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_M0_TIMING_MIN_DESELECT
// Description : After this window's chip select is deasserted, it remains
//               deasserted for half an SCK cycle (rounded up to an integer
//               number of system clock cycles), plus MIN_DESELECT additional
//               system clock cycles, before the QMI reasserts either chip
//               select pin.
//
//               Nonzero values may be required for PSRAM devices which enforce
//               a longer minimum CS deselect time, so that they can perform
//               internal DRAM refresh cycles whilst deselected.
#define QMI_M0_TIMING_MIN_DESELECT_RESET  _u(0x00)
#define QMI_M0_TIMING_MIN_DESELECT_BITS   _u(0x0001f000)
#define QMI_M0_TIMING_MIN_DESELECT_MSB    _u(16)
#define QMI_M0_TIMING_MIN_DESELECT_LSB    _u(12)
#define QMI_M0_TIMING_MIN_DESELECT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_M0_TIMING_RXDELAY
// Description : Delay the read data sample timing, in units of one half of a
//               system clock cycle. (Not necessarily half of an SCK cycle.) An
//               RXDELAY of 0 means the sample is captured at the SDI input
//               registers simultaneously with the rising edge of SCK launched
//               from the SCK output register.
//
//               At higher SCK frequencies, RXDELAY may need to be increased to
//               account for the round trip delay of the pads, and the clock-
//               to-Q delay of the QSPI memory device.
