Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/qmi.h
#define QMI_M0_TIMING_RXDELAY_RESET  _u(0x0)
#define QMI_M0_TIMING_RXDELAY_BITS   _u(0x00000700)
#define QMI_M0_TIMING_RXDELAY_MSB    _u(10)
#define QMI_M0_TIMING_RXDELAY_LSB    _u(8)
#define QMI_M0_TIMING_RXDELAY_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_M0_TIMING_CLKDIV
// Description : Clock divisor. Odd and even divisors are supported. Defines the
//               SCK clock period in units of 1 system clock cycle. Divisors
//               1..255 are encoded directly, and a divisor of 256 is encoded
//               with a value of CLKDIV=0.
//
//               The clock divisor can be changed on-the-fly, even when the QMI
//               is currently accessing memory in this address window. All other
//               parameters must only be changed when the QMI is idle.
//
//               If software is increasing CLKDIV in anticipation of an increase
//               in the system clock frequency, a dummy access to either memory
//               window (and appropriate processor barriers/fences) must be
//               inserted after the Mx_TIMING write to ensure the SCK divisor
//               change is in effect _before_ the system clock is changed.
#define QMI_M0_TIMING_CLKDIV_RESET  _u(0x04)
#define QMI_M0_TIMING_CLKDIV_BITS   _u(0x000000ff)
#define QMI_M0_TIMING_CLKDIV_MSB    _u(7)
#define QMI_M0_TIMING_CLKDIV_LSB    _u(0)
#define QMI_M0_TIMING_CLKDIV_ACCESS "RW"
// =============================================================================
// Register    : QMI_M0_RFMT
// Description : Read transfer format configuration for memory address window 0.
//
//               Configure the bus width of each transfer phase individually,
//               and configure the length or presence of the command prefix,
//               command suffix and dummy/turnaround transfer phases. Only
//               24-bit addresses are supported.
//
//               The reset value of the M0_RFMT register is configured to
//               support a basic 03h serial read transfer with no additional
//               configuration.
#define QMI_M0_RFMT_OFFSET _u(0x00000010)
#define QMI_M0_RFMT_BITS   _u(0x1007d3ff)
#define QMI_M0_RFMT_RESET  _u(0x00001000)
// -----------------------------------------------------------------------------
// Field       : QMI_M0_RFMT_DTR
// Description : Enable double transfer rate (DTR) for read commands: address,
//               suffix and read data phases are active on both edges of SCK.
//               SDO data is launched centre-aligned on each SCK edge, and SDI
//               data is captured on the SCK edge that follows its launch.
//
//               DTR is implemented by halving the clock rate; SCK has a period
//               of 2 x CLK_DIV throughout the transfer. The prefix and dummy
//               phases are still single transfer rate.
//
//               If the suffix is quad-width, it must be 0 or 8 bits in length,
//               to ensure an even number of SCK edges.
#define QMI_M0_RFMT_DTR_RESET  _u(0x0)
#define QMI_M0_RFMT_DTR_BITS   _u(0x10000000)
#define QMI_M0_RFMT_DTR_MSB    _u(28)
#define QMI_M0_RFMT_DTR_LSB    _u(28)
#define QMI_M0_RFMT_DTR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_M0_RFMT_DUMMY_LEN
// Description : Length of dummy phase between command suffix and data phase, in
//               units of 4 bits. (i.e. 1 cycle for quad width, 2 for dual, 4
//               for single)
//               0x0 -> No dummy phase
//               0x1 -> 4 dummy bits
//               0x2 -> 8 dummy bits
//               0x3 -> 12 dummy bits
//               0x4 -> 16 dummy bits
//               0x5 -> 20 dummy bits
//               0x6 -> 24 dummy bits
//               0x7 -> 28 dummy bits
#define QMI_M0_RFMT_DUMMY_LEN_RESET  _u(0x0)
#define QMI_M0_RFMT_DUMMY_LEN_BITS   _u(0x00070000)
#define QMI_M0_RFMT_DUMMY_LEN_MSB    _u(18)
#define QMI_M0_RFMT_DUMMY_LEN_LSB    _u(16)
#define QMI_M0_RFMT_DUMMY_LEN_ACCESS "RW"
#define QMI_M0_RFMT_DUMMY_LEN_VALUE_NONE _u(0x0)
#define QMI_M0_RFMT_DUMMY_LEN_VALUE_4 _u(0x1)
#define QMI_M0_RFMT_DUMMY_LEN_VALUE_8 _u(0x2)
#define QMI_M0_RFMT_DUMMY_LEN_VALUE_12 _u(0x3)
#define QMI_M0_RFMT_DUMMY_LEN_VALUE_16 _u(0x4)
#define QMI_M0_RFMT_DUMMY_LEN_VALUE_20 _u(0x5)
#define QMI_M0_RFMT_DUMMY_LEN_VALUE_24 _u(0x6)
#define QMI_M0_RFMT_DUMMY_LEN_VALUE_28 _u(0x7)
// -----------------------------------------------------------------------------
// Field       : QMI_M0_RFMT_SUFFIX_LEN
// Description : Length of post-address command suffix, in units of 4 bits.
//               (i.e. 1 cycle for quad width, 2 for dual, 4 for single)
//
//               Only values of 0 and 8 bits are supported.
//               0x0 -> No suffix
//               0x2 -> 8-bit suffix
#define QMI_M0_RFMT_SUFFIX_LEN_RESET  _u(0x0)
#define QMI_M0_RFMT_SUFFIX_LEN_BITS   _u(0x0000c000)
#define QMI_M0_RFMT_SUFFIX_LEN_MSB    _u(15)
#define QMI_M0_RFMT_SUFFIX_LEN_LSB    _u(14)
#define QMI_M0_RFMT_SUFFIX_LEN_ACCESS "RW"
#define QMI_M0_RFMT_SUFFIX_LEN_VALUE_NONE _u(0x0)
#define QMI_M0_RFMT_SUFFIX_LEN_VALUE_8 _u(0x2)
// -----------------------------------------------------------------------------
// Field       : QMI_M0_RFMT_PREFIX_LEN
// Description : Length of command prefix, in units of 8 bits. (i.e. 2 cycles
//               for quad width, 4 for dual, 8 for single)
//               0x0 -> No prefix
//               0x1 -> 8-bit prefix
#define QMI_M0_RFMT_PREFIX_LEN_RESET  _u(0x1)
#define QMI_M0_RFMT_PREFIX_LEN_BITS   _u(0x00001000)
#define QMI_M0_RFMT_PREFIX_LEN_MSB    _u(12)
#define QMI_M0_RFMT_PREFIX_LEN_LSB    _u(12)
#define QMI_M0_RFMT_PREFIX_LEN_ACCESS "RW"
#define QMI_M0_RFMT_PREFIX_LEN_VALUE_NONE _u(0x0)
#define QMI_M0_RFMT_PREFIX_LEN_VALUE_8 _u(0x1)
// -----------------------------------------------------------------------------
// Field       : QMI_M0_RFMT_DATA_WIDTH
// Description : The width used for the data transfer
//               0x0 -> Single width
//               0x1 -> Dual width
//               0x2 -> Quad width
#define QMI_M0_RFMT_DATA_WIDTH_RESET  _u(0x0)
#define QMI_M0_RFMT_DATA_WIDTH_BITS   _u(0x00000300)
#define QMI_M0_RFMT_DATA_WIDTH_MSB    _u(9)
#define QMI_M0_RFMT_DATA_WIDTH_LSB    _u(8)
#define QMI_M0_RFMT_DATA_WIDTH_ACCESS "RW"
#define QMI_M0_RFMT_DATA_WIDTH_VALUE_S _u(0x0)
#define QMI_M0_RFMT_DATA_WIDTH_VALUE_D _u(0x1)
#define QMI_M0_RFMT_DATA_WIDTH_VALUE_Q _u(0x2)
// -----------------------------------------------------------------------------
// Field       : QMI_M0_RFMT_DUMMY_WIDTH
// Description : The width used for the dummy phase, if any.
//
//               If width is single, SD0/MOSI is held asserted low during the
//               dummy phase, and SD1...SD3 are tristated. If width is
//               dual/quad, all IOs are tristated during the dummy phase.
//               0x0 -> Single width
//               0x1 -> Dual width
//               0x2 -> Quad width
#define QMI_M0_RFMT_DUMMY_WIDTH_RESET  _u(0x0)
#define QMI_M0_RFMT_DUMMY_WIDTH_BITS   _u(0x000000c0)
#define QMI_M0_RFMT_DUMMY_WIDTH_MSB    _u(7)
#define QMI_M0_RFMT_DUMMY_WIDTH_LSB    _u(6)
#define QMI_M0_RFMT_DUMMY_WIDTH_ACCESS "RW"
#define QMI_M0_RFMT_DUMMY_WIDTH_VALUE_S _u(0x0)
#define QMI_M0_RFMT_DUMMY_WIDTH_VALUE_D _u(0x1)
#define QMI_M0_RFMT_DUMMY_WIDTH_VALUE_Q _u(0x2)
// -----------------------------------------------------------------------------
// Field       : QMI_M0_RFMT_SUFFIX_WIDTH
// Description : The width used for the post-address command suffix, if any
//               0x0 -> Single width
//               0x1 -> Dual width
//               0x2 -> Quad width
#define QMI_M0_RFMT_SUFFIX_WIDTH_RESET  _u(0x0)
#define QMI_M0_RFMT_SUFFIX_WIDTH_BITS   _u(0x00000030)
#define QMI_M0_RFMT_SUFFIX_WIDTH_MSB    _u(5)
#define QMI_M0_RFMT_SUFFIX_WIDTH_LSB    _u(4)
#define QMI_M0_RFMT_SUFFIX_WIDTH_ACCESS "RW"
#define QMI_M0_RFMT_SUFFIX_WIDTH_VALUE_S _u(0x0)
#define QMI_M0_RFMT_SUFFIX_WIDTH_VALUE_D _u(0x1)
#define QMI_M0_RFMT_SUFFIX_WIDTH_VALUE_Q _u(0x2)
// -----------------------------------------------------------------------------
// Field       : QMI_M0_RFMT_ADDR_WIDTH
// Description : The transfer width used for the address. The address phase
//               always transfers 24 bits in total.
//               0x0 -> Single width
//               0x1 -> Dual width
//               0x2 -> Quad width
#define QMI_M0_RFMT_ADDR_WIDTH_RESET  _u(0x0)
#define QMI_M0_RFMT_ADDR_WIDTH_BITS   _u(0x0000000c)
#define QMI_M0_RFMT_ADDR_WIDTH_MSB    _u(3)
#define QMI_M0_RFMT_ADDR_WIDTH_LSB    _u(2)
#define QMI_M0_RFMT_ADDR_WIDTH_ACCESS "RW"
#define QMI_M0_RFMT_ADDR_WIDTH_VALUE_S _u(0x0)
#define QMI_M0_RFMT_ADDR_WIDTH_VALUE_D _u(0x1)
#define QMI_M0_RFMT_ADDR_WIDTH_VALUE_Q _u(0x2)
// -----------------------------------------------------------------------------
// Field       : QMI_M0_RFMT_PREFIX_WIDTH
// Description : The transfer width used for the command prefix, if any
//               0x0 -> Single width
//               0x1 -> Dual width
//               0x2 -> Quad width
#define QMI_M0_RFMT_PREFIX_WIDTH_RESET  _u(0x0)
#define QMI_M0_RFMT_PREFIX_WIDTH_BITS   _u(0x00000003)
#define QMI_M0_RFMT_PREFIX_WIDTH_MSB    _u(1)
#define QMI_M0_RFMT_PREFIX_WIDTH_LSB    _u(0)
#define QMI_M0_RFMT_PREFIX_WIDTH_ACCESS "RW"
#define QMI_M0_RFMT_PREFIX_WIDTH_VALUE_S _u(0x0)
#define QMI_M0_RFMT_PREFIX_WIDTH_VALUE_D _u(0x1)
#define QMI_M0_RFMT_PREFIX_WIDTH_VALUE_Q _u(0x2)
// =============================================================================
// Register    : QMI_M0_RCMD
// Description : Command constants used for reads from memory address window 0.
//
//               The reset value of the M0_RCMD register is configured to
//               support a basic 03h serial read transfer with no additional
//               configuration.
#define QMI_M0_RCMD_OFFSET _u(0x00000014)
#define QMI_M0_RCMD_BITS   _u(0x0000ffff)
#define QMI_M0_RCMD_RESET  _u(0x0000a003)
// -----------------------------------------------------------------------------
// Field       : QMI_M0_RCMD_SUFFIX
// Description : The command suffix bits following the address, if
//               Mx_RFMT_SUFFIX_LEN is nonzero.
#define QMI_M0_RCMD_SUFFIX_RESET  _u(0xa0)
#define QMI_M0_RCMD_SUFFIX_BITS   _u(0x0000ff00)
#define QMI_M0_RCMD_SUFFIX_MSB    _u(15)
#define QMI_M0_RCMD_SUFFIX_LSB    _u(8)
#define QMI_M0_RCMD_SUFFIX_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_M0_RCMD_PREFIX
// Description : The command prefix bits to prepend on each new transfer, if
//               Mx_RFMT_PREFIX_LEN is nonzero.
#define QMI_M0_RCMD_PREFIX_RESET  _u(0x03)
#define QMI_M0_RCMD_PREFIX_BITS   _u(0x000000ff)
#define QMI_M0_RCMD_PREFIX_MSB    _u(7)
#define QMI_M0_RCMD_PREFIX_LSB    _u(0)
#define QMI_M0_RCMD_PREFIX_ACCESS "RW"
// =============================================================================
// Register    : QMI_M0_WFMT
// Description : Write transfer format configuration for memory address window
//               0.
//
//               Configure the bus width of each transfer phase individually,
//               and configure the length or presence of the command prefix,
//               command suffix and dummy/turnaround transfer phases. Only
//               24-bit addresses are supported.
//
//               The reset value of the M0_WFMT register is configured to
//               support a basic 02h serial write transfer. However, writes to
//               this window must first be enabled via the XIP_CTRL_WRITABLE_M0
//               bit, as XIP memory is read-only by default.
#define QMI_M0_WFMT_OFFSET _u(0x00000018)
#define QMI_M0_WFMT_BITS   _u(0x1007d3ff)
#define QMI_M0_WFMT_RESET  _u(0x00001000)
// -----------------------------------------------------------------------------
// Field       : QMI_M0_WFMT_DTR
// Description : Enable double transfer rate (DTR) for write commands: address,
//               suffix and write data phases are active on both edges of SCK.
//               SDO data is launched centre-aligned on each SCK edge, and SDI
//               data is captured on the SCK edge that follows its launch.
//
//               DTR is implemented by halving the clock rate; SCK has a period
//               of 2 x CLK_DIV throughout the transfer. The prefix and dummy
//               phases are still single transfer rate.
//
//               If the suffix is quad-width, it must be 0 or 8 bits in length,
//               to ensure an even number of SCK edges.
#define QMI_M0_WFMT_DTR_RESET  _u(0x0)
#define QMI_M0_WFMT_DTR_BITS   _u(0x10000000)
#define QMI_M0_WFMT_DTR_MSB    _u(28)
#define QMI_M0_WFMT_DTR_LSB    _u(28)
#define QMI_M0_WFMT_DTR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_M0_WFMT_DUMMY_LEN
// Description : Length of dummy phase between command suffix and data phase, in
//               units of 4 bits. (i.e. 1 cycle for quad width, 2 for dual, 4
//               for single)
//               0x0 -> No dummy phase
//               0x1 -> 4 dummy bits
//               0x2 -> 8 dummy bits
//               0x3 -> 12 dummy bits
//               0x4 -> 16 dummy bits
//               0x5 -> 20 dummy bits
//               0x6 -> 24 dummy bits
//               0x7 -> 28 dummy bits
#define QMI_M0_WFMT_DUMMY_LEN_RESET  _u(0x0)
#define QMI_M0_WFMT_DUMMY_LEN_BITS   _u(0x00070000)
#define QMI_M0_WFMT_DUMMY_LEN_MSB    _u(18)
#define QMI_M0_WFMT_DUMMY_LEN_LSB    _u(16)
#define QMI_M0_WFMT_DUMMY_LEN_ACCESS "RW"
#define QMI_M0_WFMT_DUMMY_LEN_VALUE_NONE _u(0x0)
#define QMI_M0_WFMT_DUMMY_LEN_VALUE_4 _u(0x1)
#define QMI_M0_WFMT_DUMMY_LEN_VALUE_8 _u(0x2)
#define QMI_M0_WFMT_DUMMY_LEN_VALUE_12 _u(0x3)
#define QMI_M0_WFMT_DUMMY_LEN_VALUE_16 _u(0x4)
#define QMI_M0_WFMT_DUMMY_LEN_VALUE_20 _u(0x5)
#define QMI_M0_WFMT_DUMMY_LEN_VALUE_24 _u(0x6)
#define QMI_M0_WFMT_DUMMY_LEN_VALUE_28 _u(0x7)
// -----------------------------------------------------------------------------
// Field       : QMI_M0_WFMT_SUFFIX_LEN
// Description : Length of post-address command suffix, in units of 4 bits.
//               (i.e. 1 cycle for quad width, 2 for dual, 4 for single)
//
//               Only values of 0 and 8 bits are supported.
//               0x0 -> No suffix
//               0x2 -> 8-bit suffix
#define QMI_M0_WFMT_SUFFIX_LEN_RESET  _u(0x0)
#define QMI_M0_WFMT_SUFFIX_LEN_BITS   _u(0x0000c000)
#define QMI_M0_WFMT_SUFFIX_LEN_MSB    _u(15)
#define QMI_M0_WFMT_SUFFIX_LEN_LSB    _u(14)
#define QMI_M0_WFMT_SUFFIX_LEN_ACCESS "RW"
#define QMI_M0_WFMT_SUFFIX_LEN_VALUE_NONE _u(0x0)
#define QMI_M0_WFMT_SUFFIX_LEN_VALUE_8 _u(0x2)
// -----------------------------------------------------------------------------
// Field       : QMI_M0_WFMT_PREFIX_LEN
// Description : Length of command prefix, in units of 8 bits. (i.e. 2 cycles
//               for quad width, 4 for dual, 8 for single)
//               0x0 -> No prefix
//               0x1 -> 8-bit prefix
#define QMI_M0_WFMT_PREFIX_LEN_RESET  _u(0x1)
#define QMI_M0_WFMT_PREFIX_LEN_BITS   _u(0x00001000)
#define QMI_M0_WFMT_PREFIX_LEN_MSB    _u(12)
#define QMI_M0_WFMT_PREFIX_LEN_LSB    _u(12)
#define QMI_M0_WFMT_PREFIX_LEN_ACCESS "RW"
#define QMI_M0_WFMT_PREFIX_LEN_VALUE_NONE _u(0x0)
#define QMI_M0_WFMT_PREFIX_LEN_VALUE_8 _u(0x1)
// -----------------------------------------------------------------------------
// Field       : QMI_M0_WFMT_DATA_WIDTH
// Description : The width used for the data transfer
//               0x0 -> Single width
//               0x1 -> Dual width
//               0x2 -> Quad width
#define QMI_M0_WFMT_DATA_WIDTH_RESET  _u(0x0)
#define QMI_M0_WFMT_DATA_WIDTH_BITS   _u(0x00000300)
#define QMI_M0_WFMT_DATA_WIDTH_MSB    _u(9)
#define QMI_M0_WFMT_DATA_WIDTH_LSB    _u(8)
#define QMI_M0_WFMT_DATA_WIDTH_ACCESS "RW"
#define QMI_M0_WFMT_DATA_WIDTH_VALUE_S _u(0x0)
#define QMI_M0_WFMT_DATA_WIDTH_VALUE_D _u(0x1)
#define QMI_M0_WFMT_DATA_WIDTH_VALUE_Q _u(0x2)
// -----------------------------------------------------------------------------
// Field       : QMI_M0_WFMT_DUMMY_WIDTH
// Description : The width used for the dummy phase, if any.
//
//               If width is single, SD0/MOSI is held asserted low during the
//               dummy phase, and SD1...SD3 are tristated. If width is
//               dual/quad, all IOs are tristated during the dummy phase.
//               0x0 -> Single width
//               0x1 -> Dual width
//               0x2 -> Quad width
#define QMI_M0_WFMT_DUMMY_WIDTH_RESET  _u(0x0)
#define QMI_M0_WFMT_DUMMY_WIDTH_BITS   _u(0x000000c0)
#define QMI_M0_WFMT_DUMMY_WIDTH_MSB    _u(7)
#define QMI_M0_WFMT_DUMMY_WIDTH_LSB    _u(6)
#define QMI_M0_WFMT_DUMMY_WIDTH_ACCESS "RW"
#define QMI_M0_WFMT_DUMMY_WIDTH_VALUE_S _u(0x0)
#define QMI_M0_WFMT_DUMMY_WIDTH_VALUE_D _u(0x1)
#define QMI_M0_WFMT_DUMMY_WIDTH_VALUE_Q _u(0x2)
// -----------------------------------------------------------------------------
// Field       : QMI_M0_WFMT_SUFFIX_WIDTH
// Description : The width used for the post-address command suffix, if any
//               0x0 -> Single width
//               0x1 -> Dual width
//               0x2 -> Quad width
#define QMI_M0_WFMT_SUFFIX_WIDTH_RESET  _u(0x0)
#define QMI_M0_WFMT_SUFFIX_WIDTH_BITS   _u(0x00000030)
#define QMI_M0_WFMT_SUFFIX_WIDTH_MSB    _u(5)
#define QMI_M0_WFMT_SUFFIX_WIDTH_LSB    _u(4)
#define QMI_M0_WFMT_SUFFIX_WIDTH_ACCESS "RW"
#define QMI_M0_WFMT_SUFFIX_WIDTH_VALUE_S _u(0x0)
#define QMI_M0_WFMT_SUFFIX_WIDTH_VALUE_D _u(0x1)
#define QMI_M0_WFMT_SUFFIX_WIDTH_VALUE_Q _u(0x2)
// -----------------------------------------------------------------------------
// Field       : QMI_M0_WFMT_ADDR_WIDTH
// Description : The transfer width used for the address. The address phase
//               always transfers 24 bits in total.
//               0x0 -> Single width
//               0x1 -> Dual width
//               0x2 -> Quad width
#define QMI_M0_WFMT_ADDR_WIDTH_RESET  _u(0x0)
#define QMI_M0_WFMT_ADDR_WIDTH_BITS   _u(0x0000000c)
#define QMI_M0_WFMT_ADDR_WIDTH_MSB    _u(3)
#define QMI_M0_WFMT_ADDR_WIDTH_LSB    _u(2)
#define QMI_M0_WFMT_ADDR_WIDTH_ACCESS "RW"
#define QMI_M0_WFMT_ADDR_WIDTH_VALUE_S _u(0x0)
#define QMI_M0_WFMT_ADDR_WIDTH_VALUE_D _u(0x1)
#define QMI_M0_WFMT_ADDR_WIDTH_VALUE_Q _u(0x2)
// -----------------------------------------------------------------------------
// Field       : QMI_M0_WFMT_PREFIX_WIDTH
// Description : The transfer width used for the command prefix, if any
//               0x0 -> Single width
//               0x1 -> Dual width
//               0x2 -> Quad width
#define QMI_M0_WFMT_PREFIX_WIDTH_RESET  _u(0x0)
#define QMI_M0_WFMT_PREFIX_WIDTH_BITS   _u(0x00000003)
#define QMI_M0_WFMT_PREFIX_WIDTH_MSB    _u(1)
#define QMI_M0_WFMT_PREFIX_WIDTH_LSB    _u(0)
#define QMI_M0_WFMT_PREFIX_WIDTH_ACCESS "RW"
#define QMI_M0_WFMT_PREFIX_WIDTH_VALUE_S _u(0x0)
#define QMI_M0_WFMT_PREFIX_WIDTH_VALUE_D _u(0x1)
#define QMI_M0_WFMT_PREFIX_WIDTH_VALUE_Q _u(0x2)
// =============================================================================
// Register    : QMI_M0_WCMD
// Description : Command constants used for writes to memory address window 0.
//
//               The reset value of the M0_WCMD register is configured to
//               support a basic 02h serial write transfer with no additional
//               configuration.
#define QMI_M0_WCMD_OFFSET _u(0x0000001c)
#define QMI_M0_WCMD_BITS   _u(0x0000ffff)
#define QMI_M0_WCMD_RESET  _u(0x0000a002)
// -----------------------------------------------------------------------------
// Field       : QMI_M0_WCMD_SUFFIX
// Description : The command suffix bits following the address, if
//               Mx_WFMT_SUFFIX_LEN is nonzero.
#define QMI_M0_WCMD_SUFFIX_RESET  _u(0xa0)
#define QMI_M0_WCMD_SUFFIX_BITS   _u(0x0000ff00)
#define QMI_M0_WCMD_SUFFIX_MSB    _u(15)
#define QMI_M0_WCMD_SUFFIX_LSB    _u(8)
#define QMI_M0_WCMD_SUFFIX_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_M0_WCMD_PREFIX
// Description : The command prefix bits to prepend on each new transfer, if
//               Mx_WFMT_PREFIX_LEN is nonzero.
#define QMI_M0_WCMD_PREFIX_RESET  _u(0x02)
#define QMI_M0_WCMD_PREFIX_BITS   _u(0x000000ff)
#define QMI_M0_WCMD_PREFIX_MSB    _u(7)
#define QMI_M0_WCMD_PREFIX_LSB    _u(0)
#define QMI_M0_WCMD_PREFIX_ACCESS "RW"
// =============================================================================
// Register    : QMI_M1_TIMING
// Description : Timing configuration register for memory address window 1.
#define QMI_M1_TIMING_OFFSET _u(0x00000020)
#define QMI_M1_TIMING_BITS   _u(0xf3fff7ff)
#define QMI_M1_TIMING_RESET  _u(0x40000004)
// -----------------------------------------------------------------------------
// Field       : QMI_M1_TIMING_COOLDOWN
// Description : Chip select cooldown period. When a memory transfer finishes,
//               the chip select remains asserted for 64 x COOLDOWN system clock
//               cycles, plus half an SCK clock period (rounded up for odd SCK
//               divisors). After this cooldown expires, the chip select is
//               always deasserted to save power.
//
//               If the next memory access arrives within the cooldown period,
//               the QMI may be able to append more SCK cycles to the currently
//               ongoing SPI transfer, rather than starting a new transfer. This
//               reduces access latency and increases bus throughput.
//
//               Specifically, the next access must be in the same direction
//               (read/write), access the same memory window (chip select 0/1),
//               and follow sequentially the address of the last transfer. If
//               any of these are false, the new access will first deassert the
//               chip select, then begin a new transfer.
//
//               If COOLDOWN is 0, the address alignment configured by PAGEBREAK
//               has been reached, or the total chip select assertion limit
//               MAX_SELECT has been reached, the cooldown period is skipped,
//               and the chip select will always be deasserted one half SCK
//               period after the transfer finishes.
#define QMI_M1_TIMING_COOLDOWN_RESET  _u(0x1)
#define QMI_M1_TIMING_COOLDOWN_BITS   _u(0xc0000000)
#define QMI_M1_TIMING_COOLDOWN_MSB    _u(31)
#define QMI_M1_TIMING_COOLDOWN_LSB    _u(30)
#define QMI_M1_TIMING_COOLDOWN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_M1_TIMING_PAGEBREAK
// Description : When page break is enabled, chip select will automatically
//               deassert when crossing certain power-of-2-aligned address
//               boundaries. The next access will always begin a new read/write
//               SPI burst, even if the address of the next access follows in
//               sequence with the last access before the page boundary.
//
//               Some flash and PSRAM devices forbid crossing page boundaries
//               with a single read/write transfer, or restrict the operating
//               frequency for transfers that do cross page a boundary. This
//               option allows the QMI to safely support those devices.
//
//               This field has no effect when COOLDOWN is disabled.
//               0x0 -> No page boundary is enforced
//               0x1 -> Break bursts crossing a 256-byte page boundary
//               0x2 -> Break bursts crossing a 1024-byte quad-page boundary
//               0x3 -> Break bursts crossing a 4096-byte sector boundary
#define QMI_M1_TIMING_PAGEBREAK_RESET  _u(0x0)
#define QMI_M1_TIMING_PAGEBREAK_BITS   _u(0x30000000)
#define QMI_M1_TIMING_PAGEBREAK_MSB    _u(29)
#define QMI_M1_TIMING_PAGEBREAK_LSB    _u(28)
#define QMI_M1_TIMING_PAGEBREAK_ACCESS "RW"
#define QMI_M1_TIMING_PAGEBREAK_VALUE_NONE _u(0x0)
