Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/qmi.h
#define QMI_M1_WFMT_ADDR_WIDTH_VALUE_S _u(0x0)
#define QMI_M1_WFMT_ADDR_WIDTH_VALUE_D _u(0x1)
#define QMI_M1_WFMT_ADDR_WIDTH_VALUE_Q _u(0x2)
// -----------------------------------------------------------------------------
// Field       : QMI_M1_WFMT_PREFIX_WIDTH
// Description : The transfer width used for the command prefix, if any
//               0x0 -> Single width
//               0x1 -> Dual width
//               0x2 -> Quad width
#define QMI_M1_WFMT_PREFIX_WIDTH_RESET  _u(0x0)
#define QMI_M1_WFMT_PREFIX_WIDTH_BITS   _u(0x00000003)
#define QMI_M1_WFMT_PREFIX_WIDTH_MSB    _u(1)
#define QMI_M1_WFMT_PREFIX_WIDTH_LSB    _u(0)
#define QMI_M1_WFMT_PREFIX_WIDTH_ACCESS "RW"
#define QMI_M1_WFMT_PREFIX_WIDTH_VALUE_S _u(0x0)
#define QMI_M1_WFMT_PREFIX_WIDTH_VALUE_D _u(0x1)
#define QMI_M1_WFMT_PREFIX_WIDTH_VALUE_Q _u(0x2)
// =============================================================================
// Register    : QMI_M1_WCMD
// Description : Command constants used for writes to memory address window 1.
//
//               The reset value of the M1_WCMD register is configured to
//               support a basic 02h serial write transfer with no additional
//               configuration.
#define QMI_M1_WCMD_OFFSET _u(0x00000030)
#define QMI_M1_WCMD_BITS   _u(0x0000ffff)
#define QMI_M1_WCMD_RESET  _u(0x0000a002)
// -----------------------------------------------------------------------------
// Field       : QMI_M1_WCMD_SUFFIX
// Description : The command suffix bits following the address, if
//               Mx_WFMT_SUFFIX_LEN is nonzero.
#define QMI_M1_WCMD_SUFFIX_RESET  _u(0xa0)
#define QMI_M1_WCMD_SUFFIX_BITS   _u(0x0000ff00)
#define QMI_M1_WCMD_SUFFIX_MSB    _u(15)
#define QMI_M1_WCMD_SUFFIX_LSB    _u(8)
#define QMI_M1_WCMD_SUFFIX_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_M1_WCMD_PREFIX
// Description : The command prefix bits to prepend on each new transfer, if
//               Mx_WFMT_PREFIX_LEN is nonzero.
#define QMI_M1_WCMD_PREFIX_RESET  _u(0x02)
#define QMI_M1_WCMD_PREFIX_BITS   _u(0x000000ff)
#define QMI_M1_WCMD_PREFIX_MSB    _u(7)
#define QMI_M1_WCMD_PREFIX_LSB    _u(0)
#define QMI_M1_WCMD_PREFIX_ACCESS "RW"
// =============================================================================
// Register    : QMI_ATRANS0
// Description : Configure address translation for XIP virtual addresses
//               0x000000 through 0x3fffff (a 4 MiB window starting at +0 MiB).
//
//               Address translation allows a program image to be executed in
//               place at multiple physical flash addresses (for example, a
//               double-buffered flash image for over-the-air updates), without
//               the overhead of position-independent code.
//
//               At reset, the address translation registers are initialised to
//               an identity mapping, so that they can be ignored if address
//               translation is not required.
//
//               Note that the XIP cache is fully virtually addressed, so a
//               cache flush is required after changing the address translation.
#define QMI_ATRANS0_OFFSET _u(0x00000034)
#define QMI_ATRANS0_BITS   _u(0x07ff0fff)
#define QMI_ATRANS0_RESET  _u(0x04000000)
// -----------------------------------------------------------------------------
// Field       : QMI_ATRANS0_SIZE
// Description : Translation aperture size for this virtual address range, in
//               units of 4 kiB (one flash sector).
//
//               Bits 21:12 of the virtual address are compared to SIZE. Offsets
//               greater than SIZE return a bus error, and do not cause a QSPI
//               access.
#define QMI_ATRANS0_SIZE_RESET  _u(0x400)
#define QMI_ATRANS0_SIZE_BITS   _u(0x07ff0000)
#define QMI_ATRANS0_SIZE_MSB    _u(26)
#define QMI_ATRANS0_SIZE_LSB    _u(16)
#define QMI_ATRANS0_SIZE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_ATRANS0_BASE
// Description : Physical address base for this virtual address range, in units
//               of 4 kiB (one flash sector).
//
//               Taking a 24-bit virtual address, firstly bits 23:22 (the two
//               MSBs) are masked to zero, and then BASE is added to bits 23:12
//               (the upper 12 bits) to form the physical address. Translation
//               wraps on a 16 MiB boundary.
#define QMI_ATRANS0_BASE_RESET  _u(0x000)
#define QMI_ATRANS0_BASE_BITS   _u(0x00000fff)
#define QMI_ATRANS0_BASE_MSB    _u(11)
#define QMI_ATRANS0_BASE_LSB    _u(0)
#define QMI_ATRANS0_BASE_ACCESS "RW"
// =============================================================================
// Register    : QMI_ATRANS1
// Description : Configure address translation for XIP virtual addresses
//               0x400000 through 0x7fffff (a 4 MiB window starting at +4 MiB).
//
//               Address translation allows a program image to be executed in
//               place at multiple physical flash addresses (for example, a
//               double-buffered flash image for over-the-air updates), without
//               the overhead of position-independent code.
//
//               At reset, the address translation registers are initialised to
//               an identity mapping, so that they can be ignored if address
//               translation is not required.
//
//               Note that the XIP cache is fully virtually addressed, so a
//               cache flush is required after changing the address translation.
#define QMI_ATRANS1_OFFSET _u(0x00000038)
#define QMI_ATRANS1_BITS   _u(0x07ff0fff)
#define QMI_ATRANS1_RESET  _u(0x04000400)
// -----------------------------------------------------------------------------
// Field       : QMI_ATRANS1_SIZE
// Description : Translation aperture size for this virtual address range, in
//               units of 4 kiB (one flash sector).
//
//               Bits 21:12 of the virtual address are compared to SIZE. Offsets
//               greater than SIZE return a bus error, and do not cause a QSPI
//               access.
#define QMI_ATRANS1_SIZE_RESET  _u(0x400)
#define QMI_ATRANS1_SIZE_BITS   _u(0x07ff0000)
#define QMI_ATRANS1_SIZE_MSB    _u(26)
#define QMI_ATRANS1_SIZE_LSB    _u(16)
#define QMI_ATRANS1_SIZE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_ATRANS1_BASE
// Description : Physical address base for this virtual address range, in units
//               of 4 kiB (one flash sector).
//
//               Taking a 24-bit virtual address, firstly bits 23:22 (the two
//               MSBs) are masked to zero, and then BASE is added to bits 23:12
//               (the upper 12 bits) to form the physical address. Translation
//               wraps on a 16 MiB boundary.
#define QMI_ATRANS1_BASE_RESET  _u(0x400)
#define QMI_ATRANS1_BASE_BITS   _u(0x00000fff)
#define QMI_ATRANS1_BASE_MSB    _u(11)
#define QMI_ATRANS1_BASE_LSB    _u(0)
#define QMI_ATRANS1_BASE_ACCESS "RW"
// =============================================================================
// Register    : QMI_ATRANS2
// Description : Configure address translation for XIP virtual addresses
//               0x800000 through 0xbfffff (a 4 MiB window starting at +8 MiB).
//
//               Address translation allows a program image to be executed in
//               place at multiple physical flash addresses (for example, a
//               double-buffered flash image for over-the-air updates), without
//               the overhead of position-independent code.
//
//               At reset, the address translation registers are initialised to
//               an identity mapping, so that they can be ignored if address
//               translation is not required.
//
//               Note that the XIP cache is fully virtually addressed, so a
//               cache flush is required after changing the address translation.
#define QMI_ATRANS2_OFFSET _u(0x0000003c)
#define QMI_ATRANS2_BITS   _u(0x07ff0fff)
#define QMI_ATRANS2_RESET  _u(0x04000800)
// -----------------------------------------------------------------------------
// Field       : QMI_ATRANS2_SIZE
// Description : Translation aperture size for this virtual address range, in
//               units of 4 kiB (one flash sector).
//
//               Bits 21:12 of the virtual address are compared to SIZE. Offsets
//               greater than SIZE return a bus error, and do not cause a QSPI
//               access.
#define QMI_ATRANS2_SIZE_RESET  _u(0x400)
#define QMI_ATRANS2_SIZE_BITS   _u(0x07ff0000)
#define QMI_ATRANS2_SIZE_MSB    _u(26)
#define QMI_ATRANS2_SIZE_LSB    _u(16)
#define QMI_ATRANS2_SIZE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_ATRANS2_BASE
// Description : Physical address base for this virtual address range, in units
//               of 4 kiB (one flash sector).
//
//               Taking a 24-bit virtual address, firstly bits 23:22 (the two
//               MSBs) are masked to zero, and then BASE is added to bits 23:12
//               (the upper 12 bits) to form the physical address. Translation
//               wraps on a 16 MiB boundary.
#define QMI_ATRANS2_BASE_RESET  _u(0x800)
#define QMI_ATRANS2_BASE_BITS   _u(0x00000fff)
#define QMI_ATRANS2_BASE_MSB    _u(11)
#define QMI_ATRANS2_BASE_LSB    _u(0)
#define QMI_ATRANS2_BASE_ACCESS "RW"
// =============================================================================
// Register    : QMI_ATRANS3
// Description : Configure address translation for XIP virtual addresses
//               0xc00000 through 0xffffff (a 4 MiB window starting at +12 MiB).
//
//               Address translation allows a program image to be executed in
//               place at multiple physical flash addresses (for example, a
//               double-buffered flash image for over-the-air updates), without
//               the overhead of position-independent code.
//
//               At reset, the address translation registers are initialised to
//               an identity mapping, so that they can be ignored if address
//               translation is not required.
//
//               Note that the XIP cache is fully virtually addressed, so a
//               cache flush is required after changing the address translation.
#define QMI_ATRANS3_OFFSET _u(0x00000040)
#define QMI_ATRANS3_BITS   _u(0x07ff0fff)
#define QMI_ATRANS3_RESET  _u(0x04000c00)
// -----------------------------------------------------------------------------
// Field       : QMI_ATRANS3_SIZE
// Description : Translation aperture size for this virtual address range, in
//               units of 4 kiB (one flash sector).
//
//               Bits 21:12 of the virtual address are compared to SIZE. Offsets
//               greater than SIZE return a bus error, and do not cause a QSPI
//               access.
#define QMI_ATRANS3_SIZE_RESET  _u(0x400)
#define QMI_ATRANS3_SIZE_BITS   _u(0x07ff0000)
#define QMI_ATRANS3_SIZE_MSB    _u(26)
#define QMI_ATRANS3_SIZE_LSB    _u(16)
#define QMI_ATRANS3_SIZE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_ATRANS3_BASE
// Description : Physical address base for this virtual address range, in units
//               of 4 kiB (one flash sector).
//
//               Taking a 24-bit virtual address, firstly bits 23:22 (the two
//               MSBs) are masked to zero, and then BASE is added to bits 23:12
//               (the upper 12 bits) to form the physical address. Translation
//               wraps on a 16 MiB boundary.
#define QMI_ATRANS3_BASE_RESET  _u(0xc00)
#define QMI_ATRANS3_BASE_BITS   _u(0x00000fff)
#define QMI_ATRANS3_BASE_MSB    _u(11)
#define QMI_ATRANS3_BASE_LSB    _u(0)
#define QMI_ATRANS3_BASE_ACCESS "RW"
// =============================================================================
// Register    : QMI_ATRANS4
// Description : Configure address translation for XIP virtual addresses
//               0x1000000 through 0x13fffff (a 4 MiB window starting at +16
//               MiB).
//
//               Address translation allows a program image to be executed in
//               place at multiple physical flash addresses (for example, a
//               double-buffered flash image for over-the-air updates), without
//               the overhead of position-independent code.
//
//               At reset, the address translation registers are initialised to
//               an identity mapping, so that they can be ignored if address
//               translation is not required.
//
//               Note that the XIP cache is fully virtually addressed, so a
//               cache flush is required after changing the address translation.
#define QMI_ATRANS4_OFFSET _u(0x00000044)
#define QMI_ATRANS4_BITS   _u(0x07ff0fff)
#define QMI_ATRANS4_RESET  _u(0x04000000)
// -----------------------------------------------------------------------------
// Field       : QMI_ATRANS4_SIZE
// Description : Translation aperture size for this virtual address range, in
//               units of 4 kiB (one flash sector).
//
//               Bits 21:12 of the virtual address are compared to SIZE. Offsets
//               greater than SIZE return a bus error, and do not cause a QSPI
//               access.
#define QMI_ATRANS4_SIZE_RESET  _u(0x400)
#define QMI_ATRANS4_SIZE_BITS   _u(0x07ff0000)
#define QMI_ATRANS4_SIZE_MSB    _u(26)
#define QMI_ATRANS4_SIZE_LSB    _u(16)
#define QMI_ATRANS4_SIZE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_ATRANS4_BASE
// Description : Physical address base for this virtual address range, in units
//               of 4 kiB (one flash sector).
//
//               Taking a 24-bit virtual address, firstly bits 23:22 (the two
//               MSBs) are masked to zero, and then BASE is added to bits 23:12
//               (the upper 12 bits) to form the physical address. Translation
//               wraps on a 16 MiB boundary.
#define QMI_ATRANS4_BASE_RESET  _u(0x000)
#define QMI_ATRANS4_BASE_BITS   _u(0x00000fff)
#define QMI_ATRANS4_BASE_MSB    _u(11)
#define QMI_ATRANS4_BASE_LSB    _u(0)
#define QMI_ATRANS4_BASE_ACCESS "RW"
// =============================================================================
// Register    : QMI_ATRANS5
// Description : Configure address translation for XIP virtual addresses
//               0x1400000 through 0x17fffff (a 4 MiB window starting at +20
//               MiB).
//
//               Address translation allows a program image to be executed in
//               place at multiple physical flash addresses (for example, a
//               double-buffered flash image for over-the-air updates), without
//               the overhead of position-independent code.
//
//               At reset, the address translation registers are initialised to
//               an identity mapping, so that they can be ignored if address
//               translation is not required.
//
//               Note that the XIP cache is fully virtually addressed, so a
//               cache flush is required after changing the address translation.
#define QMI_ATRANS5_OFFSET _u(0x00000048)
#define QMI_ATRANS5_BITS   _u(0x07ff0fff)
#define QMI_ATRANS5_RESET  _u(0x04000400)
// -----------------------------------------------------------------------------
// Field       : QMI_ATRANS5_SIZE
// Description : Translation aperture size for this virtual address range, in
//               units of 4 kiB (one flash sector).
//
//               Bits 21:12 of the virtual address are compared to SIZE. Offsets
//               greater than SIZE return a bus error, and do not cause a QSPI
//               access.
#define QMI_ATRANS5_SIZE_RESET  _u(0x400)
#define QMI_ATRANS5_SIZE_BITS   _u(0x07ff0000)
#define QMI_ATRANS5_SIZE_MSB    _u(26)
#define QMI_ATRANS5_SIZE_LSB    _u(16)
#define QMI_ATRANS5_SIZE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_ATRANS5_BASE
// Description : Physical address base for this virtual address range, in units
//               of 4 kiB (one flash sector).
//
//               Taking a 24-bit virtual address, firstly bits 23:22 (the two
//               MSBs) are masked to zero, and then BASE is added to bits 23:12
//               (the upper 12 bits) to form the physical address. Translation
//               wraps on a 16 MiB boundary.
#define QMI_ATRANS5_BASE_RESET  _u(0x400)
#define QMI_ATRANS5_BASE_BITS   _u(0x00000fff)
#define QMI_ATRANS5_BASE_MSB    _u(11)
#define QMI_ATRANS5_BASE_LSB    _u(0)
#define QMI_ATRANS5_BASE_ACCESS "RW"
// =============================================================================
// Register    : QMI_ATRANS6
// Description : Configure address translation for XIP virtual addresses
//               0x1800000 through 0x1bfffff (a 4 MiB window starting at +24
//               MiB).
//
//               Address translation allows a program image to be executed in
//               place at multiple physical flash addresses (for example, a
//               double-buffered flash image for over-the-air updates), without
//               the overhead of position-independent code.
//
//               At reset, the address translation registers are initialised to
//               an identity mapping, so that they can be ignored if address
//               translation is not required.
//
//               Note that the XIP cache is fully virtually addressed, so a
//               cache flush is required after changing the address translation.
#define QMI_ATRANS6_OFFSET _u(0x0000004c)
#define QMI_ATRANS6_BITS   _u(0x07ff0fff)
#define QMI_ATRANS6_RESET  _u(0x04000800)
// -----------------------------------------------------------------------------
// Field       : QMI_ATRANS6_SIZE
// Description : Translation aperture size for this virtual address range, in
//               units of 4 kiB (one flash sector).
//
//               Bits 21:12 of the virtual address are compared to SIZE. Offsets
//               greater than SIZE return a bus error, and do not cause a QSPI
//               access.
#define QMI_ATRANS6_SIZE_RESET  _u(0x400)
#define QMI_ATRANS6_SIZE_BITS   _u(0x07ff0000)
#define QMI_ATRANS6_SIZE_MSB    _u(26)
#define QMI_ATRANS6_SIZE_LSB    _u(16)
#define QMI_ATRANS6_SIZE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_ATRANS6_BASE
// Description : Physical address base for this virtual address range, in units
//               of 4 kiB (one flash sector).
//
//               Taking a 24-bit virtual address, firstly bits 23:22 (the two
//               MSBs) are masked to zero, and then BASE is added to bits 23:12
//               (the upper 12 bits) to form the physical address. Translation
//               wraps on a 16 MiB boundary.
#define QMI_ATRANS6_BASE_RESET  _u(0x800)
#define QMI_ATRANS6_BASE_BITS   _u(0x00000fff)
#define QMI_ATRANS6_BASE_MSB    _u(11)
#define QMI_ATRANS6_BASE_LSB    _u(0)
#define QMI_ATRANS6_BASE_ACCESS "RW"
// =============================================================================
// Register    : QMI_ATRANS7
// Description : Configure address translation for XIP virtual addresses
//               0x1c00000 through 0x1ffffff (a 4 MiB window starting at +28
//               MiB).
//
//               Address translation allows a program image to be executed in
//               place at multiple physical flash addresses (for example, a
//               double-buffered flash image for over-the-air updates), without
//               the overhead of position-independent code.
//
//               At reset, the address translation registers are initialised to
//               an identity mapping, so that they can be ignored if address
//               translation is not required.
//
//               Note that the XIP cache is fully virtually addressed, so a
//               cache flush is required after changing the address translation.
#define QMI_ATRANS7_OFFSET _u(0x00000050)
#define QMI_ATRANS7_BITS   _u(0x07ff0fff)
#define QMI_ATRANS7_RESET  _u(0x04000c00)
// -----------------------------------------------------------------------------
// Field       : QMI_ATRANS7_SIZE
// Description : Translation aperture size for this virtual address range, in
//               units of 4 kiB (one flash sector).
//
//               Bits 21:12 of the virtual address are compared to SIZE. Offsets
//               greater than SIZE return a bus error, and do not cause a QSPI
//               access.
#define QMI_ATRANS7_SIZE_RESET  _u(0x400)
#define QMI_ATRANS7_SIZE_BITS   _u(0x07ff0000)
#define QMI_ATRANS7_SIZE_MSB    _u(26)
#define QMI_ATRANS7_SIZE_LSB    _u(16)
#define QMI_ATRANS7_SIZE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : QMI_ATRANS7_BASE
// Description : Physical address base for this virtual address range, in units
//               of 4 kiB (one flash sector).
//
//               Taking a 24-bit virtual address, firstly bits 23:22 (the two
//               MSBs) are masked to zero, and then BASE is added to bits 23:12
//               (the upper 12 bits) to form the physical address. Translation
//               wraps on a 16 MiB boundary.
#define QMI_ATRANS7_BASE_RESET  _u(0xc00)
#define QMI_ATRANS7_BASE_BITS   _u(0x00000fff)
#define QMI_ATRANS7_BASE_MSB    _u(11)
#define QMI_ATRANS7_BASE_LSB    _u(0)
#define QMI_ATRANS7_BASE_ACCESS "RW"
// =============================================================================
#endif // _HARDWARE_REGS_QMI_H

